/*
** ПРОЈЕКАТ : ::: Принципи програмирања :::
**            Основе програмирања у програмском језику Ц
** ДАТОТЕКА : Vezbe05 > Zadatak01 > Zadatak01.c
** ОПИС     : Написати функцију која на екрану приказује број прослеђен као аргумент.
** ДАТУМ    : 02.02.2025.
** ЛОКАЦИЈА : Београд
** АУТОРИ   : Саша Д. Лазаревић, Татјана Стојановић, Кристина Јовановић
** ПРОМЕНЕ  :
**   <dd.mm.gggg.> - <опис промене> (<програмер>)
**	 05.02.2025. - измењено заглавље програма (КЈ)
**
** Copyright (C) ФОН-ЛСИ/FON-LSI, 2025.
*/

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

void prikazi_broj(int broj) {
	printf("Prosledili ste broj %d\n", broj);
}

int main() {

	prikazi_broj(24);	// можемо проследити број директно

	int broj = 15;
	prikazi_broj(broj);	// или можемо направити променљиву и проследити њу

	return 0;
}