/*
** ПРОЈЕКАТ : ::: Принципи програмирања :::
**            Основе програмирања у програмском језику Ц
** ДАТОТЕКА : Vezbe05 > Zadatak03 > Zadatak03.c
** ОПИС     : Написати функцију која проверава да ли је број прост. Уколико јесте - вратити 1, у супротном вратити 0.
**			  Користећи претходну функцију, написати функцију која исписује све просте троцифрене бројеве.
** ДАТУМ    : 02.02.2025.
** ЛОКАЦИЈА : Београд
** АУТОРИ   : Саша Д. Лазаревић, Татјана Стојановић, Кристина Јовановић
** ПРОМЕНЕ  :
**   <dd.mm.gggg.> - <опис промене> (<програмер>)
**	 05.02.2025. - измењено заглавље програма (КЈ)
**
** Copyright (C) ФОН-ЛСИ/FON-LSI, 2025.
*/

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int da_li_je_prost(int broj) {
	for (int i = 2;i < broj / 2;i++) {
		if (broj % i == 0)
			return 0;	// пронашли смо неко i којим је наш broj дељив => број није прост
	}
	return 1;	// прошли смо кроз целу петљу (if услов није био задовољен ниједном) => број је прост
}

void ispisi_proste_trocifrene() {
	printf("Prosti trocifreni brojevi:\n");
	for (int i = 100;i <= 999;i++) {
		if (da_li_je_prost(i) == 1) {
			printf("%d\n", i);
		}
	}
}

int main() {

	printf("%d\n", da_li_je_prost(11)); // 1 => број је прост
	printf("%d\n", da_li_je_prost(12)); // 0 => број није прост

	ispisi_proste_trocifrene();

	return 0;
}