/*
** ПРОЈЕКАТ : ::: Принципи програмирања :::
**            Основе програмирања у програмском језику Ц
** ДАТОТЕКА : Vezbe05 > Zadatak02 > Zadatak02.c
** ОПИС     : Написати функцију која проверава да ли је број паран. Уколико јесте - вратити 1, у супротном вратити 0.
** ДАТУМ    : 02.02.2025.
** ЛОКАЦИЈА : Београд
** АУТОРИ   : Саша Д. Лазаревић, Татјана Стојановић, Кристина Јовановић
** ПРОМЕНЕ  :
**   <dd.mm.gggg.> - <опис промене> (<програмер>)
**	 05.02.2025. - измењено заглавље програма (КЈ)
**
** Copyright (C) ФОН-ЛСИ/FON-LSI, 2025.
*/

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int da_li_je_paran(int broj) {
	if (broj % 2 == 0)
		return 1;
	else
		return 0;	// да ли је else грана била неопходна?
}

int main() {

	printf("%d\n", da_li_je_paran(5));
	printf("%d\n", da_li_je_paran(10));
	// можемо позвати функцију директно из неке друге функције (у овом случају printf) 

	return 0;
}