/*
** ПРОЈЕКАТ : ::: Принципи програмирања :::
**            Основе програмирања у програмском језику Ц
** ДАТОТЕКА : Vezbe06 > Zadatak01 > Zadatak01.c
** ОПИС     : Дефинисати низ целих бројева. Написати функције за испис елемената низа унапред и уназад.
** ДАТУМ    : 02.02.2025.
** ЛОКАЦИЈА : Београд
** АУТОРИ   : Саша Д. Лазаревић, Татјана Стојановић, Кристина Јовановић
** ПРОМЕНЕ  :
**   <dd.mm.gggg.> - <опис промене> (<програмер>)
**	 05.02.2025. - измењено заглавље програма (КЈ)
**
** Copyright (C) ФОН-ЛСИ/FON-LSI, 2025.
*/

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

// дефинисање назива нумеричке константе = дефинисање макроа без параметра
#define DIM 10

// прототипови функција
void ispisi_niz(int niz[]);
void ispisi_niz2(int niz[], int broj_elemenata);
void ispisi_niz_unazad(int niz[], int broj_elemenata);

int main() {

	// 1)
	//int niz1[DIM];
	//niz1[DIM] = { 1,2,3,4,5,6,7,8 };
	// НЕПРАВИЛНО! Уколико желимо иницијализацију низа на овај начин, морамо то учинити одмах приликом декларације 
	// или можемо иницијализовати елемент по елемент приступајући преко индекса
	
	// 2)
	int niz2[DIM];
	niz2[0] = 6;
	niz2[1] = 3;
	niz2[5] = 7;

	ispisi_niz(niz2);
	// Шта се налази на позицијама које нисмо иницијализовали?

	// 3)
	int niz3[DIM] = { 1,2,3,4,5,6,7,8 };
	// Која је димензија низа, а колико елемената смо иницијализовали? Шта ће бити са преосталим елементима?
	
	ispisi_niz(niz3);
	// Шта ако желимо да испишемо само оне елементе које смо ми иницијализовали?
	//		- можемо поставити димензију низа на тачно онолико елемената колико нам треба
	//		- можемо чувати број елемената низа као променљиву и исписивати елементе низа до тог броја, а не до броја димензије низа

	int broj_el = 8;
	ispisi_niz2(niz3, broj_el);

	ispisi_niz_unazad(niz3, broj_el);

	return 0;
}

// имплементације функција
void ispisi_niz(int niz[]) {
	printf("Niz: ");
	for (int i = 0;i < DIM;i++) {
		printf("%d ", niz[i]);
	}
	printf("\n\n");
}

void ispisi_niz2(int niz[], int broj_elemenata) {
	printf("Niz: ");
	for (int i = 0;i < broj_elemenata;i++) {
		printf("%d ", niz[i]);
	}
	printf("\n\n");
}

void ispisi_niz_unazad(int niz[], int broj_elemenata) {
	printf("Niz unazad: ");
	for (int i = broj_elemenata - 1;i >= 0;i--) {
		printf("%d ", niz[i]);
	}
	printf("\n\n");
}

